Revit 2024 API
AnalysisDisplayStyleVectorPosition Enumeration
 Defines vector position for vector settings of analysis display style.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Since: 2012
Syntax
C#
public enum AnalysisDisplayStyleVectorPosition
Visual Basic
Public Enumeration AnalysisDisplayStyleVectorPosition
Visual C++
public enum class AnalysisDisplayStyleVectorPosition
Members
Member name | Description
ToDataPoint
FromDataPoint
See Also
Autodesk.Revit.DB.Analysis Namespace